

## 규칙을 찾아보자
## 
## N = 2 -> 3, 1 (3 사분면) (r>=2 c<2) -> 1 1
## N = 3 -> 7,7 (4사분면)(r,c >= 4) 그 내부에서 4사분면 (r,c>=2)
## 값을 어떻게 분배할까 -> 7,7 ->3,3 계산 법 -> 2**N -1 다음에는 2**(N-1) -1ㅇㅇ
N ,r, c= map(int,input().split())
result = 0
while N :
    ## 1사분면
    if r<2**(N-1) and c<2**(N-1):
        result += 2**(N-1)*2**(N-1)*0
    ## 2사분면
    if r<2**(N-1) and c>=2**(N-1):
        result += 2**(N-1)*2**(N-1)*1
        ## 2사분면의 경우 
        ## 예시 N = 3 , r= 0, c = 4 -> n = 2 에서 r=0, c= c- 2**N-1
        c-=2**(N-1)
    ## 3
    if r>=2**(N-1) and c<2**(N-1):
        result += 2**(N-1)*2**(N-1)*2
        r-=2**(N-1)
    ## 4
    if r>=2**(N-1) and c>=2**(N-1):
        result += 2**(N-1)*2**(N-1)*3
        r-=2**(N-1)
        c-=2**(N-1)
    N-=1
print(result)